In [8]:
setwd('/Users/gimdong-wan/Desktop/김동완 수업자료/통계 데이터베이스/Final_project')

In [9]:
library("DBI")
library("RSQLite")

In [10]:
conn = dbConnect(SQLite(), dbname = "/Users/gimdong-wan/Desktop/김동완 수업자료/통계 데이터베이스/RSQl/customer.sqlite")

In [11]:
dbExecute(conn, "PRAGMA foreign_keys=ON")

[1] 0

In [12]:
sql = "CREATE TABLE IF NOT EXISTS Prof
( PID TEXT PRIMARY KEY, 
PName TEXT not null,
PDept Text)"

rs = dbSendQuery(conn, sql)

# rs 제거
dbClearResult(rs)

# 테이블이 생성되었는지(존재하는지) 확인
dbExistsTable(conn, "Bicycle")

[1] FALSE

In [13]:
#학생 테이블 생성하기
sql = "CREATE TABLE IF NOT EXISTS Student  
( SID TEXT PRIMARY KEY, 
Name TEXT not null,
Dept TEXT not null,
Grade INTEGER not null,
PID TEXT,
FOREIGN KEY(PID) REFERENCES Prof(PID) ) "

rs = dbSendQuery(conn, sql)

# rs 제거

dbClearResult(rs)
dbExistsTable(conn, "Student")

[1] TRUE

In [14]:
#교과목 테이블 생성하기

sql = "CREATE TABLE IF NOT EXISTS Curriculum  
( SubjectID TEXT PRIMARY KEY, 
SubjectName TEXT not null ) "

rs = dbSendQuery(conn, sql)

#rs 제거
dbClearResult(rs)
dbExistsTable(conn, "Curriculum")

[1] TRUE

In [15]:
#성적 테이블 생성하기
sql = "CREATE TABLE IF NOT EXISTS Score  
( SID TEXT , 
SubjectID TEXT ,
Score INTEGER default 0,
PRIMARY KEY(SID, SubjectID)
FOREIGN KEY(SID) REFERENCES Student(SID),
FOREIGN KEY(SubjectID) REFERENCES Curriculum(SubjectID)) "

rs = dbSendQuery(conn, sql)

#rs 제거
dbClearResult(rs)
dbExistsTable(conn, "Score")

[1] TRUE

In [16]:
dbListTables(conn)

[1] "Curriculum"     "Customer_Info"  "Customer_Score" "Prof"
[5] "Score"          "Student"

In [106]:
dbExistsTable(conn, "Prof")
dbExistsTable(conn, "Student")
dbExistsTable(conn, "Curriculum")
dbExistsTable(conn, "Score")

[1] TRUE

[1] TRUE

[1] TRUE

[1] TRUE

In [107]:
 # Prof 테이블에 데이터 insert
sql = " INSERT INTO Prof 
VALUES ('0515', '안정용교수님', '통계학과') "

rs = dbSendQuery(conn, sql)
dbClearResult(rs)

# Prof 테이블에 데이터 삽입 결과 확인
dbGetQuery(conn, "SELECT * FROM Prof")

  PID  PName        PDept
1 0515 안정용교수님 통계학과

In [108]:
 # Student 테이블에 데이터 insert
sql = " INSERT INTO Student 
VALUES ('201616525', '김동완', '사회학과',4,'0515') "

rs = dbSendQuery(conn, sql)
dbClearResult(rs)

# Studetn 테이블에 데이터 삽입 결과 확인
dbGetQuery(conn, "SELECT * FROM Student")

  SID       Name   Dept     Grade PID
1 201616525 김동완 사회학과 4     0515

In [109]:
 # Curriculum 테이블에 데이터 insert
sql = " INSERT INTO Curriculum 
VALUES ('05', '통계데이터베이스') "

rs = dbSendQuery(conn, sql)
dbClearResult(rs)

# Curriculum 테이블에 데이터 삽입 결과 확인
dbGetQuery(conn, "SELECT * FROM Curriculum")

  SubjectID SubjectName
1 05        통계데이터베이스

In [110]:
 # Score 테이블에 데이터 insert
sql = " INSERT INTO Score 
VALUES ('201616525','05', 0) "

rs = dbSendQuery(conn, sql)
dbClearResult(rs)

# Score 테이블에 데이터 삽입 결과 확인
dbGetQuery(conn, "SELECT * FROM Score")

  SID       SubjectID Score
1 201616525 05        0

In [78]:
dbGetQuery(conn, "SELECT * FROM Prof")
dbGetQuery(conn, "SELECT * FROM Student")
dbGetQuery(conn, "SELECT * FROM Curriculum")
dbGetQuery(conn, "SELECT * FROM Score")

  PID  PName        PDept
1 0515 안정용교수님 통계학과

  SID       Name   Dept     Grade PID
1 201616525 김동완 사회학과 4     0515

  SubjectID SubjectName
1 05        통계데이터베이스

  SID       SubjectID Score
1 201616525 05        0

3.5절에서 예제로 제시한 성적관련 데이터베이스에서 
    ① Prof 테이블의 교수이름, 학과 
    ② Score 테이블의 모든 필드
데이터를 검색하는 SQL 문을 작성하시오.

In [195]:
Prof = read.csv('RSQL/Prof.csv', encoding = "UTF-8",header=T)

In [196]:
Curriculum = read.csv('RSQL/Curriculum.csv', encoding = "UTF-8",header=T)

In [197]:
Score = read.csv('RSQL/Score.csv', encoding = "UTF-8",header=T)

In [198]:
Student = read.csv('RSQL/Student.csv', encoding = "UTF-8",header=T)

In [199]:
# CSV 화일의 데이터를 Prof 테이블에 삽입하기
dbWriteTable(conn = conn, name = "Prof", Prof,
overwrite=T, row.names=FALSE)

In [200]:
# CSV 화일의 데이터를 Curriculumo 테이블에 삽입하기
dbWriteTable(conn = conn, name = "Curriculum", Curriculum,
overwrite=T, row.names=FALSE)

In [201]:
# CSV 화일의 데이터를 Score 테이블에 삽입하기
dbWriteTable(conn = conn, name = "Score", Score,
overwrite=T, row.names=FALSE)

In [202]:
# CSV 화일의 데이터를 Student 테이블에 삽입하기
dbWriteTable(conn = conn, name = "Student", Student,
overwrite=T, row.names=FALSE)

In [203]:
sql = "SELECT PName, PDept FROM Prof" 
dbGetQuery(conn, sql)

  Pname        Pdept
1 안정용교수님 통계학과
2 최혜미교수님 통계학과
3 김재우교수님 사회학과
4 송정기교수님 사회학과

In [204]:
dbReadTable(conn, "Score")
dbReadTable(conn, "Curriculum")
dbReadTable(conn, "Student")
dbReadTable(conn, "Prof")

   SID       SubjectID Score
1  201616525 9990      98
2  201412323 9991      65
3  201523233 9992      76
4  201212121 9993      54
5  201523233 9990      76
6  201616525 9991      87
7  201412323 9992      98
8  201523233 9993      77
9  201212121 9993      66
10 201523233 9990      77

  SubjectID SubjectName
1 9990      환경과발전
2 9991      통계데이터베이스
3 9992      한국사회분석실습
4 9993      응용통계학

  SID       Name   Dept     Grade PID
1 201616525 김동완 사회학과 4     10003
2 201412323 홍길동 통계학과 2     10001
3 201523293 임꺽정 사회학과 3     10003
4 201212121 박정화 통계학과 3     10002
5 201523233 김삿갓 사회학과 1     10004

  PID   Pname        Pdept
1 10001 안정용교수님 통계학과
2 10002 최혜미교수님 통계학과
3 10003 김재우교수님 사회학과
4 10004 송정기교수님 사회학과

In [205]:
sql = "SELECT all * FROM Score" 
dbGetQuery(conn, sql)

   SID       SubjectID Score
1  201616525 9990      98
2  201412323 9991      65
3  201523233 9992      76
4  201212121 9993      54
5  201523233 9990      76
6  201616525 9991      87
7  201412323 9992      98
8  201523233 9993      77
9  201212121 9993      66
10 201523233 9990      77

성적관련 데이터베이스의 성적테이블에는 학번(PID) 필드가 있다. 중복을 제거하고 학번을 검색하는 SQL 문을 작성하시오.

In [206]:
sql = "SELECT DISTINCT SID FROM SCORE" 
dbGetQuery(conn, sql)

  SID
1 201616525
2 201412323
3 201523233
4 201212121

성적관련 데이터베이스에서 학생별, 교과목별 점수의 평균을 파악할 수 있는 SQL 문을 작성하시오.

In [207]:
sql = "SELECT SubjectID, avg(Score) FROM Score
GROUP BY SubjectID " 
dbGetQuery(conn, sql)

  SubjectID avg(Score)
1 9990      83.66667
2 9991      76.00000
3 9992      87.00000
4 9993      65.66667

In [208]:
sql = "SELECT SID, avg(Score) FROM Score
GROUP BY SID" 
dbGetQuery(conn, sql)

  SID       avg(Score)
1 201212121 60.0
2 201412323 81.5
3 201523233 76.5
4 201616525 92.5

In [225]:
sql = "SELECT CS.SID, C.Name, avg(Score)
FROM Score CS
JOIN Student C
ON C.SID = CS.SID 
GROUP BY C.Name"
dbGetQuery(conn, sql)

  SID       Name   avg(Score)
1 201616525 김동완 92.5
2 201523233 김삿갓 76.5
3 201212121 박정화 60.0
4 201412323 홍길동 81.5

In [228]:
sql = "SELECT CS.SubjectID, C.SubjectName, avg(Score)
FROM Score CS
JOIN Curriculum C
ON C.SubjectID = CS.SubjectID 
GROUP BY C.SubjectName"
dbGetQuery(conn, sql)

  SubjectID SubjectName      avg(Score)
1 9993      응용통계학       65.66667
2 9991      통계데이터베이스 76.00000
3 9992      한국사회분석실습 87.00000
4 9990      환경과발전       83.66667

과제 4.14성적관련 데이터베이스에서 학생별 점수의 평균을 파악할 수 있는 SQL 문을 작성하시오. (단, 평균 점수가 70 이상인 학생만을 검색)

In [232]:
sql = "SELECT CS.SID, C.Name, avg(Score)
FROM Score CS
JOIN Student C
ON C.SID = CS.SID 
WHERE Score >= 70
GROUP BY C.Name"
dbGetQuery(conn, sql)

  SID       Name   avg(Score)
1 201616525 김동완 92.5
2 201523233 김삿갓 76.5
3 201412323 홍길동 98.0

과제 4.15 성적관련 데이터베이스에서 학생의 평균 점수를 오름차순으로 검색할 수 있는 SQL 문을 작성하시오.

In [233]:
sql = "SELECT CS.SID, C.Name, avg(Score)
FROM Score CS
JOIN Student C
ON C.SID = CS.SID 
GROUP BY C.Name
ORDER BY avg(Score)"
dbGetQuery(conn, sql)

  SID       Name   avg(Score)
1 201212121 박정화 60.0
2 201523233 김삿갓 76.5
3 201412323 홍길동 81.5
4 201616525 김동완 92.5

테이블 Student와 Score에서 학생이름, 점수 등을 검색하는 SQL 문을 작성하시오.

In [234]:
sql = "SELECT SID, Name FROM Student
WHERE sID IN ( SELECT SID
FROM Score )
"

dbGetQuery(conn, sql)

  SID       Name
1 201616525 김동완
2 201412323 홍길동
3 201212121 박정화
4 201523233 김삿갓

In [18]:
sql = "SELECT SID, Score FROM Score
WHERE SID IN ( SELECT SID,Name
FROM Student )
and Score > 60 "
dbGetQuery(conn, sql)

ERROR: Error: sub-select returns 2 columns - expected 1

In [250]:
sql = "SELECT CS.SID, C.Name,C.Dept,Grade, Score
FROM Score CS
JOIN Student C
ON C.SID = CS.SID
ORDER BY Score"
dbGetQuery(conn, sql)

   SID       Name   Dept     Grade Score
1  201212121 박정화 통계학과 3     54
2  201412323 홍길동 통계학과 2     65
3  201212121 박정화 통계학과 3     66
4  201523233 김삿갓 사회학과 1     76
5  201523233 김삿갓 사회학과 1     76
6  201523233 김삿갓 사회학과 1     77
7  201523233 김삿갓 사회학과 1     77
8  201616525 김동완 사회학과 4     87
9  201616525 김동완 사회학과 4     98
10 201412323 홍길동 통계학과 2     98